app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def map2
    @json = Item.all.to_gmaps4rails

INSERT INTO "items" ("address", "bought", "created_at", "description", "gmaps", "image", "latitude", "longitude", "name", "owner_id", "price", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save